test/stress/artillery.yml
config:
  target: "http://localhost:3000/api/ranks?si=경기&gu=수원시%20권선구&dong=세류동"
  phases:
    - duration: 10
      arrivalRate: 5
      name: Warm up
    - duration: 20
      arrivalRate: 5
      rampTo: 10
      name: Ramp up road
    - duration: 30
      arrivalRate: 10
      name: Sustained road
#  payload:
#    path: "keywords.csv"
#    fields:
#      - "keyword"

scenarios:
  - name: "Find Ranks"
    flow:
#      - post:
#          url: "/search"
#          json:
#            kw: "{{ keyword }}"
#          capture:
#            - json: "$.results[0].id"
#              as: "productId"
      - get:
          url: "/"
#      - think: 5
#      - post:
#          url: "/cart"
#          json:
#            productId: "{{ productId }}"